// import { useMemo } from "react";
import { ColDef } from "ag-grid-community";

// filter text localization
export const LOCAL = {
  equals: "برابر",
  lessThan: "کوچک تر از",
  greaterThan: "بزرگ تر از",
  notEqual: "نا برابر",
  inRange: "در بازه",
  blank: "خالی",
  notBlank: "خالی نباشد ",
  contains: "شامل",
  notContains: "جزو آن نباشد",
  startsWith: "شروع شود با",
  endsWith: "تمام شود با",
  filterOoo: "جستجو...",
  to: "تا",
  of: "از",
  page: "صفحه",
};

// default columns behavior
// TODO : if any thing gose wrong add useMemo
export const defaultColDef: ColDef = {
  flex: 1,
  filter: true,
  resizable: true,
  sortable: true,
};

// temporary columns and rows
// Row Data: The data to be displayed.
export const rowData = [
  {
    "نام کاربری": "تسلا",
    "رمز عبور": "Model Y",
    "نمایندگی ": " تستتتتت ",
    "سطح نمایندگی": "تست سطح نمایندگی",
    "سطح بسته": "تست",
    "تاریخ انقضا بسته": "تاریخ",
    "ویرایش حذف": "دکمه",
  },
  {
    "نام کاربری": "بی ام و",
    "رمز عبور": "Model Y",
    "نمایندگی ": " تست دوم ",
    "سطح نمایندگی": "تست سطح نمایندگی",
    "سطح بسته": "تست",
    "تاریخ انقضا بسته": "تاریخ",
    "ویرایش حذف": "دکمه",
  },
  {
    "نام کاربری": "نیسان",
    "رمز عبور": "Model Y",
    "نمایندگی ": " تشت شوم ",
    "سطح نمایندگی": "تست سطح نمایندگی",
    "سطح بسته": "تست",
    "تاریخ انقضا بسته": "تاریخ",
    "ویرایش حذف": "دکمه",
  },
  {
    "نام کاربری": "بنز",
    "رمز عبور": "Model Y",
    "نمایندگی ": " تشت شوم ",
    "سطح نمایندگی": "تست سطح نمایندگی",
    "سطح بسته": "تست",
    "تاریخ انقضا بسته": "تاریخ",
    "ویرایش حذف": "دکمه",
  },
  {
    "نام کاربری": "بنزین",
    "رمز عبور": "Model Y",
    "نمایندگی ": " تشت شوم ",
    "سطح نمایندگی": "تست سطح نمایندگی",
    "سطح بسته": "تست",
    "تاریخ انقضا بسته": "تاریخ",
    "ویرایش حذف": "دکمه",
  },
];
export const rowData2 = [
  {
    "نام کاربری": "خر",
    "رمز عبور": "Model Y",
    "نمایندگی ": " تستتتتت ",
    "سطح نمایندگی": "تست سطح نمایندگی",
    "سطح بسته": "تست",
    "تاریخ انقضا بسته": "تاریخ",
    "ویرایش حذف": "دکمه",
  },
  {
    "نام کاربری": "بی ام و",
    "رمز عبور": "Model Y",
    "نمایندگی ": " تست دوم ",
    "سطح نمایندگی": "تست سطح نمایندگی",
    "سطح بسته": "تست",
    "تاریخ انقضا بسته": "تاریخ",
    "ویرایش حذف": "دکمه",
  },
  {
    "نام کاربری": "گاو",
    "رمز عبور": "Model Y",
    "نمایندگی ": " تشت شوم ",
    "سطح نمایندگی": "تست سطح نمایندگی",
    "سطح بسته": "تست",
    "تاریخ انقضا بسته": "تاریخ",
    "ویرایش حذف": "دکمه",
  },
  {
    "نام کاربری": "بنز",
    "رمز عبور": "Model Y",
    "نمایندگی ": " تشت شوم ",
    "سطح نمایندگی": "تست سطح نمایندگی",
    "سطح بسته": "تست",
    "تاریخ انقضا بسته": "تاریخ",
    "ویرایش حذف": "دکمه",
  },
];

// Column Definitions: Defines the columns to be displayed.
export const colDefs = [
  { field: "نام کاربری" },
  { field: "رمز عبور" },
  { field: "نمایندگی" },
  { field: "سطح نمایندگی" },
  { field: "سطح بسته" },
  { field: "تاریخ انقضا بسته" },
  { field: "ویرایش حذف" },
];
